[
  {
    "project": "B2B Website",
    "overview": "Developed B2B React applications",
    "imgSrc": "b2b.jpg",
    "description": [
      "Developed B2B React applications using Redux state management and RESTful APIs.",
      "Converted JSP screen into React screen with REST API.",
      "Optimized performance of existing React applications by utilizing best practices such as code splitting, lazy loading.",
      "Developed and maintained REST APIs for web applications using Java.",
      "Managed source control system Git when working on collaborative teams building out complex React applications.",
      "Worked closely with product owners on requirements gathering, design decisions, and implementation strategies for new features in a react application.",
      "Built reusable UI components that can be used across multiple projects with React."
    ]
  },
  {
    "project": "E-Banking Website",
    "overview": "Developing E-Banking web application using React.js and Materialize CSS",
    "imgSrc": "bank.png",
    "description": [
      "Developing E-Banking web application using React.js andMaterialize CSS.",
      "Identified web-based user interactions and developed highly responsive user interface components",
      "Developed custom switch component to select different payment type",
      "Fixed bugs from existing website and implemented enhancements that significantly improved web functionality and speed."
    ]
  },
  {
    "project": "Salesman quotation",
    "overview": "Developed Salesman quotation web app using MERN.",
    "imgSrc": "salesman.png",
    "description": [
      "Developed Salesman quotation web app using MERN.",
      "Designed and developed back-end using Express.js, Node.js and Mongo DB.",
      "Determined the structure and design of web pages based on user requirements and balanced functional & aesthetic designs.",
      "Developed custom card view to show the customer quotation request.",
      "Developed approval flow for quotation. Where all quotation will go for manager approve."
    ]
  },
  {
    "project": "Covid-19 Live Tracking",
    "overview": "Developed covid-19 live tracking website using react.js and REDUX",
    "imgSrc": "corona.jpg",
    "link": "https://indiacovid19tracking.netlify.app/",
    "description": [
      "Developed covid-19 live tracking website using react.js and REDUX.",
      "User can able to view India total number of infected, recovered,active and death cases.",
      "User can also able to select their state to view total number of infected, recovered, active and death cases.",
      "User can hover on state map to see total number of infected,recovered, active and death cases"
    ]
  },
  {
    "project": "GST invoice generator",
    "overview": "Developed small scale business management windows app",
    "imgSrc": "GST-Bill-of-Supply.jpg",
    "description": [
      "Developed small scale business management windows app using electron.js and react.js",
      "User can able to generate GST invoice bill after selling he items.",
      "User can track the buy and sell items."
    ]
  }
]
